Repository: giorgiococci/ProfetAI
Catalog: lib/l10n/app_*.arb
Languages: it

# navigationOracles
source: Oracles
it: Oracoli

# navigationProfile
source: Profile
it: Profilo

# navigationVisions
source: Visions
it: Visioni

# navigationAIStatus
source: AI Status
it: Stato AI

source: SELECT YOUR ORACLE
it: SELEZIONA IL TUO ORACOLO

# everyOracleUniquePersonality
source: Every oracle has its unique personality
it: Ogni oracolo ha la sua personalità unica

source: ASK THE ORACLE
it: DOMANDA ALL'ORACOLO

# listenToOracle
source: LET THE ORACLE SPEAK
it: LASCIA PARLARE L'ORACOLO

# enterQuestionPlaceholder
source: Ask your question to {oracleName}...
it: Poni la tua domanda all'{oracleName}...

# enterQuestionFirst
source: 📝 Enter a question before asking!
it: 📝 Inserisci una domanda prima di chiedere!

source: Mark as favorite oracle
it: Segna come oracolo preferito

# removeFromFavoriteOracle
source: Remove from favorite oracles
it: Rimuovi dagli oracoli preferiti

# favoriteOracleSet
source: ✨ {oracleName} is now your favorite oracle!
it: ✨ {oracleName} è ora il tuo oracolo preferito!

# oracleResponds
source: 🔮 {oracleName} Responds
it: 🔮 {oracleName} Risponde

# visionOf
source: ✨ Vision of {oracleName}
it: ✨ Visione di {oracleName}

# positiveResponse
source: The vision has illuminated my path
it: La visione ha illuminato il mio cammino

# negativeResponse
source: The vision was obscured
it: La visione era offuscata

# funnyResponse
source: I didn't understand, but it made me laugh
it: Non ho capito, ma mi ha fatto ridere

source: AI Status
it: Stato AI

source: AI Service Status
it: Stato Servizio AI

# aiServiceOperational
source: AI Service is operational and ready to provide responses
it: Il servizio AI è operativo e pronto a fornire risposte

# aiServiceNotAvailable
source: AI Service is not available. Check configuration.
it: Il servizio AI non è disponibile. Controllare la configurazione.

source: Configuration Status
it: Stato Configurazione

source: Build Config
it: Configurazione Build

source: Configured
it: Configurato

source: Not Configured
it: Non Configurato

source: AI Available
it: AI Disponibile

source: Yes
it: Sì

source: API Key
it: Chiave API

source: AI Enabled
it: AI Abilitata

source: Empty
it: Vuoto

source: Refresh Status
it: Aggiorna Stato

source: Copy Debug Info
it: Copia Info Debug

source: Clear Runtime Logs
it: Cancella Log Runtime

source: Runtime logs cleared
it: Log runtime cancellati

# debugInfoCopied
source: Debug information copied to clipboard
it: Informazioni debug copiate negli appunti

# visionBookComingSoon
source: Book of Visions\n(Coming Soon)
it: Libro delle Visioni\n(Coming Soon)

source: 🎯 AI Active!
it: 🎯 AI Attiva!

# aiActiveMessage
source: Artificial intelligence is configured correctly. Your oracles can provide personalized responses.\n\n{debugInfo}
it: L'intelligenza artificiale è configurata correttamente. I tuoi oracoli possono fornire risposte personalizzate.\n\n{debugInfo}

source: ⚠️ AI Not Available
it: ⚠️ AI Non Disponibile

# aiNotAvailableMessage
source: AI configuration has problems:\n\n• AI Available: {isAIAvailable}\n• Build Config Valid: {isBuildConfigValid}\n\n{debugInfo}
it: Configurazione AI ha problemi:\n\n• AI Available: {isAIAvailable}\n• Build Config Valid: {isBuildConfigValid}\n\n{debugInfo}

# oracleSilent
source: The oracle is silent...
it: L'oracolo è in silenzio...

# feedbackPositiveAction
source: Star to the Oracle
it: Stella all'Oracolo

# feedbackNegativeAction
source: Stone in the well
it: Sasso nel pozzo

# feedbackFunnyAction
source: Frog in the multiverse
it: Rana nel multiverso

# loadingProphetsFromUniverse
source: Loading prophets from the universe
it: Caricamento profeti dall'universo

source: Initialization Error
it: Errore di Inizializzazione

# failedToInitializeApp
source: Failed to initialize app: {error}
it: Impossibile inizializzare l'app: {error}

# profilePageTitle
source: Profile
it: Profilo

source: Personal Information
it: Informazioni Personali

# preferencesAndLanguages
source: Preferences & Languages
it: Preferenze e Lingue

# interestsAndTopics
source: Interests & Topics
it: Interessi e Argomenti

# nameLabel
source: Name
it: Nome

# nameHint
source: Enter your name
it: Inserisci il tuo nome

# countryLabel
source: Country
it: Paese

# countryHint
source: Select your country
it: Seleziona il tuo paese

# genderLabel
source: Gender
it: Genere

# genderHint
source: Select your gender
it: Seleziona il tuo genere

# languagesLabel
source: Languages
it: Lingue

# languagesHint
source: Select your preferred language
it: Seleziona la tua lingua preferita

# interestsLabel
source: Interests
it: Interessi

# interestsHint
source: Select your interests
it: Seleziona i tuoi interessi

source: Save Profile
it: Salva Profilo

# profileSaved
source: Profile saved successfully!
it: Profilo salvato con successo!

# genderMale
source: Male
it: Maschile

# genderFemale
source: Female
it: Femminile

# genderNonBinary
source: Non-binary
it: Non-binario

# genderPreferNotToSay
source: Prefer not to say
it: Preferisco non dirlo

# languageEnglish
source: English
it: Inglese

# languageItalian
source: Italian
it: Italiano

# interestSpirituality
source: Spirituality
it: Spiritualità

# interestMeditation
source: Meditation
it: Meditazione

# interestPhilosophy
source: Philosophy
it: Filosofia

# interestMysticism
source: Mysticism
it: Misticismo

# interestDivination
source: Divination
it: Divinazione

# interestWisdom
source: Ancient Wisdom
it: Saggezza Antica

# interestDreams
source: Dream Interpretation
it: Interpretazione dei Sogni

# interestTarot
source: Tarot
it: Tarocchi

# interestAstrology
source: Astrology
it: Astrologia

# interestNumerology
source: Numerology
it: Numerologia

# languageUpdated
source: App language updated to {language}
it: Lingua dell'app aggiornata a {language}

source: Critical Actions
it: Azioni Critiche

source: Delete All Visions
it: Elimina Tutte le Visioni

# deleteAllVisionsWarning
source: ⚠️ This action will permanently delete all your stored visions and cannot be undone. Are you sure you want to continue?
it: ⚠️ Questa azione eliminerà permanentemente tutte le tue visioni memorizzate e non può essere annullata. Sei sicuro di voler continuare?

# deleteAllVisionsConfirmTitle
source: Delete All Visions?
it: Eliminare Tutte le Visioni?

source: Cancel
it: Annulla

source: Delete
it: Elimina

# allVisionsDeleted
source: All visions have been deleted successfully
it: Tutte le visioni sono state eliminate con successo

# failedToDeleteVisions
source: Failed to delete visions. Please try again.
it: Impossibile eliminare le visioni. Riprova.

# visionBookTitle
source: Vision Book
it: Libro delle Visioni

source: Search visions
it: Cerca visioni

# refreshVisions
source: Refresh
it: Aggiorna

# visionsCount
source: {count, plural, =0{No visions} =1{1 vision} other{{count} visions}}
it: {count, plural, =0{Nessuna visione} =1{1 visione} other{{count} visioni}}

# visionsFiltered
source: {count} of {total} visions
it: {count} di {total} visioni

source: Filtered
it: Filtrate

source: Delete Vision
it: Elimina Visione

# deleteVisionConfirm
source: Are you sure you want to delete "{title}"?
it: Sei sicuro di voler eliminare "{title}"?

source: Error loading visions
it: Errore nel caricamento delle visioni

source: Vision deleted successfully
it: Visione eliminata con successo

source: Error deleting vision
it: Errore nell'eliminazione della visione

source: Feedback updated successfully
it: Feedback aggiornato con successo

source: Error updating feedback
it: Errore nell'aggiornamento del feedback

# noVisionsMatchFilters
source: No visions match your filters
it: Nessuna visione corrisponde ai filtri

source: No visions stored yet
it: Nessuna visione memorizzata

# tryAdjustingFilters
source: Try adjusting your search criteria or clear filters to see all visions.
it: Prova a modificare i criteri di ricerca o cancella i filtri per vedere tutte le visioni.

# startMysticalJourney
source: Start your mystical journey by asking the oracles for guidance.
it: Inizia il tuo viaggio mistico chiedendo agli oracoli una guida.

source: Clear Filters
it: Rimuovi Filtri

source: All Oracles
it: Tutti gli Oracoli

# oraclesSelected
source: {count} Selected
it: {count} Selezionati

source: Newest First
it: Più Recenti

source: Oldest First
it: Più Vecchi

source: Title A-Z
it: Titolo A-Z

source: Title Z-A
it: Titolo Z-A

source: By Oracle
it: Per Oracolo

# sortFilter
source: Sort: {sortType}
it: Ordina: {sortType}

source: Clear
it: Cancella

source: {time} ago
it: {time} fa

# daysShort
source: {count}d
it: {count}g

source: Just now
it: Adesso

# settingsPageTitle
source: Settings
it: Impostazioni

# userProfileSettings
source: User Profile
it: Profilo Utente

# userProfileSettingsDescription
source: Manage your personal information
it: Gestisci le tue informazioni personali

# localizationSettings
source: Localization
it: Localizzazione

# localizationSettingsDescription
source: Change app language and region
it: Cambia lingua e regione dell'app

# deleteDataSettings
source: Delete Data
it: Elimina Dati

# deleteDataSettingsDescription
source: Manage stored data and visions
it: Gestisci dati memorizzati e visioni

# userProfilePageTitle
source: User Profile
it: Profilo Utente

# localizationPageTitle
source: Localization
it: Localizzazione

# deleteDataPageTitle
source: Delete Data
it: Elimina Dati

source: Skip
it: Salta

source: Welcome to Orakl
it: Benvenuto in Orakl

# discoverMysticalInsights
source: Discover mystical insights through unique oracles
it: Scopri intuizioni mistiche attraverso oracoli unici

source: Begin Journey
it: Inizia il Viaggio

source: Unlock Mystical Powers
it: Sblocca Poteri Mistici

source: Personalized Predictions
it: Predizioni Personalizzate

# personalizedPredictionsDesc
source: Ask questions and receive tailored insights from your chosen oracle
it: Fai domande e ricevi intuizioni su misura dal tuo oracolo scelto

source: Random Visions
it: Visioni Casuali

# randomVisionsDesc
source: Get spontaneous wisdom when you need guidance most
it: Ottieni saggezza spontanea quando hai più bisogno di guida

source: Vision Book
it: Libro delle Visioni

# visionBookDesc
source: Save and revisit your favorite predictions and insights
it: Salva e rivedi le tue predizioni e intuizioni preferite

source: Unique Themes
it: Temi Unici

# uniqueThemesDesc
source: Each oracle has its own mystical visual identity
it: Ogni oracolo ha la propria identità visiva mistica

# continueButton
source: Continue
it: Continua

source: Personalize Your Experience
it: Personalizza la Tua Esperienza

# personalizeOptional
source: Optional - You can always change this later
it: Opzionale - Puoi sempre cambiarlo dopo

# whatShouldOraclesCallYou
source: What should the oracles call you?
it: Come dovrebbero chiamarti gli oracoli?

source: Enter your name (optional)
it: Inserisci il tuo nome (opzionale)

# doYouHavePreferredOracle
source: Do you have a preferred oracle?
it: Hai un oracolo preferito?

source: Enter the Mystical Realm
it: Entra nel Regno Mistico

# lifeFocusAreasLabel
source: What areas of life are you seeking guidance on?
it: In quali aree della vita cerchi guida?

# lifeFocusAreasHint
source: Select up to 3 areas (optional)
it: Seleziona fino a 3 aree (opzionale)

# lifeStageLabel
source: What best describes your current life phase?
it: Cosa descrive meglio la tua fase di vita attuale?

# lifeStageHint
source: Select your current phase (optional)
it: Seleziona la tua fase attuale (opzionale)

# lifeFocusLoveRelationships
source: Love & Relationships
it: Amore e Relazioni

# lifeFocusCareerPurpose
source: Career & Purpose
it: Carriera e Scopo

# lifeFocusFamilyHome
source: Family & Home
it: Famiglia e Casa

# lifeFocusHealthWellness
source: Health & Wellness
it: Salute e Benessere

# lifeFocusMoneyAbundance
source: Money & Abundance
it: Denaro e Abbondanza

# lifeFocusSpiritualGrowth
source: Spiritual Growth
it: Crescita Spirituale

# lifeFocusPersonalDevelopment
source: Personal Development
it: Sviluppo Personale

# lifeFocusCreativityPassion
source: Creativity & Passion
it: Creatività e Passione

# lifeStageStartingNewChapter
source: Starting a new chapter
it: Sto iniziando un nuovo capitolo

# lifeStageSeekingDirection
source: Seeking direction
it: Sto cercando una direzione

# lifeStageFacingChallenges
source: Facing challenges
it: Sto affrontando delle sfide

# lifeStagePeriodOfGrowth
source: In a period of growth
it: Sono in un periodo di crescita

# lifeStageLookingForStability
source: Looking for stability
it: Sto cercando stabilità

# lifeStageEmbracingChange
source: Embracing change
it: Sto abbracciando il cambiamento

source: Vision Management
it: Gestione Visioni

# visionManagementDescription
source: Manage your conversation history and preferences
it: Gestisci la cronologia delle conversazioni e le preferenze

source: Debug Tools
it: Strumenti Debug

source: AdMob Debug & Test
it: Debug AdMob & Test

# admobDebugTestDescription
source: Test ad functionality and callbacks
it: Testa la funzionalità e i callback degli annunci

source: Reset Onboarding
it: Reimposta Onboarding

# resetOnboardingDescription
source: Force onboarding to show again on app restart
it: Forza la visualizzazione dell'onboarding al riavvio dell'app

# resetOnboardingTitle
source: Reset Onboarding
it: Reimposta Onboarding

# resetOnboardingContent
source: This will reset the onboarding status. The onboarding flow will be shown again when you restart the app. Are you sure?
it: Questo reimposterà lo stato dell'onboarding. Il flusso di onboarding verrà mostrato di nuovo quando riavvii l'app. Sei sicuro?

source: Reset
it: Reimposta

# onboardingResetSuccess
source: Onboarding reset successfully. Restart the app to see the onboarding flow.
it: Onboarding reimpostato con successo. Riavvia l'app per vedere il flusso di onboarding.

# onboardingResetFailed
source: Failed to reset onboarding: {error}
it: Impossibile reimpostare l'onboarding: {error}

source: Conversation Statistics
it: Statistiche Conversazioni

source: Total Conversations
it: Conversazioni Totali

source: Total Messages
it: Messaggi Totali

source: Average Messages per Conversation
it: Media Messaggi per Conversazione

source: Data Management
it: Gestione Dati

source: Clear All Conversations
it: Cancella Tutte le Conversazioni

# clearAllConversationsTitle
source: Clear All Conversations
it: Cancella Tutte le Conversazioni

# clearAllConversationsContent
source: ⚠️ This action will permanently delete ALL your conversation history and cannot be undone. Are you sure you want to continue?
it: ⚠️ Questa azione eliminerà permanentemente TUTTA la cronologia delle conversazioni e non può essere annullata. Sei sicuro di voler continuare?

source: Delete All
it: Elimina Tutto

source: Deleting all conversations...
it: Eliminazione di tutte le conversazioni...

# conversationsDeletedSuccess
source: All conversations deleted successfully
it: Tutte le conversazioni eliminate con successo

# conversationsDeleteFailed
source: Failed to delete conversations: {error}
it: Impossibile eliminare le conversazioni: {error}

source: No conversations yet
it: Nessuna conversazione ancora

# noConversationsDescription
source: Start chatting with a prophet to see your conversation statistics here.
it: Inizia a chattare con un profeta per vedere le statistiche delle tue conversazioni qui.

# failedToLoadConversationData
source: Failed to load conversation data: {error}
it: Impossibile caricare i dati delle conversazioni: {error}

# personalInformationDescription
source: Manage your basic profile information
it: Gestisci le tue informazioni personali di base

# interestsAndTopicsDescription
source: Select your areas of interest
it: Seleziona le tue aree di interesse

# personalizeYourExperienceDescription
source: Customize your guidance preferences
it: Personalizza le tue preferenze di guida

source: Your AI Profile
it: Il Tuo Profilo AI

# yourAiProfileDescription
source: View your generated biographical profile and privacy settings
it: Visualizza il tuo profilo biografico generato e le impostazioni sulla privacy

# failedToLoadProfile
source: Failed to load profile: {error}
it: Impossibile caricare il profilo: {error}

# failedToSaveProfile
source: Failed to save profile: {error}
it: Impossibile salvare il profilo: {error}

source: Your Profile
it: Il Tuo Profilo

# biographicalDataDeletedSuccess
source: All biographical data deleted successfully
it: Tutti i dati biografici eliminati con successo

# failedToDeleteData
source: Failed to delete data: {error}
it: Impossibile eliminare i dati: {error}

source: Delete Biographical Data
it: Elimina Dati Biografici

# deleteBiographicalDataContent
source: This will permanently delete all your biographical information. This action cannot be undone. Are you sure you want to continue?
it: Questo eliminerà permanentemente tutte le tue informazioni biografiche. Questa azione non può essere annullata. Sei sicuro di voler continuare?

source: Delete All Data
it: Elimina Tutti i Dati

# failedToLoadBiographicalProfile
source: Failed to load biographical profile: {error}
it: Impossibile caricare il profilo biografico: {error}

source: Loading your profile...
it: Caricamento del tuo profilo...

source: Retry
it: Riprova

# noBioAvailable
source: No bio still available. The prophets need more information.
it: Nessuna biografia ancora disponibile. I profeti hanno bisogno di più informazioni.

source: Ask the Prophets
it: Chiedi ai Profeti

# yourProfileHeader
source: Your Profile
it: Il Tuo Profilo

# generatedFromProphetInteractions
source: Generated from your prophet interactions
it: Generato dalle tue interazioni con i profeti

source: No biographical content available
it: Nessun contenuto biografico disponibile

# deleteAllDataTooltip
source: Delete All Data
it: Elimina Tutti i Dati

# privacyConsentTitle
source: Data Privacy & Personalization
it: Privacy dei Dati e Personalizzazione

# privacyConsentMessage
source: To provide you with personalized responses, Orakl can store and analyze your interactions with the prophets. This data is used exclusively to improve your experience and will never be shared with external partners. Would you like to enable personalized responses?
it: Per fornirti risposte personalizzate, Orakl può memorizzare e analizzare le tue interazioni con i profeti. Questi dati sono utilizzati esclusivamente per migliorare la tua esperienza e non saranno mai condivisi con partner esterni. Vuoi abilitare le risposte personalizzate?

source: Enable Personalization
it: Abilita Personalizzazione

source: Disable Personalization
it: Disabilita Personalizzazione

source: Review Privacy Policy
it: Consulta Privacy Policy

source: Privacy Settings
it: Impostazioni Privacy

# privacySettingsDescription
source: Manage your data personalization preferences
it: Gestisci le tue preferenze di personalizzazione dati

source: Personalization Status
it: Stato Personalizzazione

source: Enabled
it: Abilitata

source: Disabled
it: Disabilitata

source: How It Works
it: Come Funziona

# personalizationEnabledDescription
source: Your interactions with prophets are being analyzed to provide personalized responses.
it: Le tue interazioni con i profeti vengono analizzate per fornire risposte personalizzate.

# personalizationDisabledDescription
source: Personalization is disabled. No data is being collected from your interactions.
it: La personalizzazione è disabilitata. Nessun dato viene raccolto dalle tue interazioni.

# personalizationEnabledFeature1
source: Insights from your questions and conversations are collected
it: Vengono raccolte informazioni dalle tue domande e conversazioni

# personalizationEnabledFeature2
source: This data helps prophets give more relevant responses
it: Questi dati aiutano i profeti a dare risposte più pertinenti

# personalizationEnabledFeature3
source: Your data is never shared with external partners
it: I tuoi dati non vengono mai condivisi con partner esterni

# personalizationDisabledFeature1
source: No personal insights are collected or stored
it: Nessuna informazione personale viene raccolta o memorizzata

# personalizationDisabledFeature2
source: Prophets provide generic responses
it: I profeti forniscono risposte generiche

# personalizationDisabledFeature3
source: You can enable personalization at any time
it: Puoi abilitare la personalizzazione in qualsiasi momento

source: Settings
it: Impostazioni

source: Updating...
it: Aggiornamento...

# disablePersonalizationWarning
source: Warning: Disabling personalization will permanently delete all collected data.
it: Attenzione: Disabilitare la personalizzazione eliminerà permanentemente tutti i dati raccolti.

# enablePersonalizationNote
source: Note: Enabling personalization will start collecting data from future interactions.
it: Nota: Abilitare la personalizzazione inizierà a raccogliere dati dalle future interazioni.

source: Confirm Disable Personalization
it: Conferma Disabilitazione Personalizzazione

# disablePersonalizationConfirmMessage
source: Are you sure you want to disable personalization? This action will permanently delete all your collected data and cannot be undone.
it: Sei sicuro di voler disabilitare la personalizzazione? Questa azione eliminerà permanentemente tutti i tuoi dati raccolti e non può essere annullata.

source: Disable
it: Disabilita

# personalizationEnabledSuccess
source: Personalization enabled successfully
it: Personalizzazione abilitata con successo

# personalizationDisabledSuccess
source: Personalization disabled and data deleted successfully
it: Personalizzazione disabilitata e dati eliminati con successo
